# <font color='blue'> Exploratory Data Analysis with Python: Part 2 of 2</font>

### Lise Doucette, Data and Statistics Librarian
### Nich Worby, Government Information and Statistics Librarian
### mdl@library.utoronto.ca

# <font color='blue'> Outline </font>

from our LibCal description: "This is the second of two workshops on exploratory data analysis using Python, and you must have completed Exploratory Data Analysis Using Python â€“ Part 1 of 2, or be familiar with reading, describing, filtering, and summarizing data using the pandas package.

This hands-on workshop in Python uses the pandas package and Jupyter Notebooks to group data, work with date and text formats, recode data, and create new variables. We will be using software installed on computers in the MDL Lab and a sample data set that includes categorical, binary, text, date, and numerical data."


In Part 2, we'll cover:

## <font color='blue'> 7 Creating crosstabs and grouping data </font> (Nich)

## <font color='blue'> Quick review from Part 1 on selecting and filtering data</font>  (Nich)

## <font color='blue'> 8 Looping and conditionals </font> (Nich)

## <font color='blue'> 8 Editing data / creating new fields </font>
### a. Creating new variable w calculation (Lise)
### b. Split name into first and last (Lise)
### c. Renaming variable categories (Lise)
### d. Binning ages (Lise)

## <font color='blue'> 9 Saving data </font> (Lise)

## <font color='blue'> Review and getting data loaded</blue>

### import libraries

In [1]:
import pandas as pd

### import existing data

In [9]:
titanic = pd.read_csv('titanic.csv', sep=';')

titanic.fare.value_counts()
titanic.head(15)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47.0000,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24.0000,0,0,PC 17477,69.3000,B35,C,9,NaN,"Paris, France"
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0000,0,0,19877,78.8500,NaN,S,6,NaN,NaN
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0000,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"

In [ ]:
example for loop with embarquation location

for i = asg to len(ags)
    if embarq = C then newembarq = Charlesbourg
    elif 
    else


for i = asg to len(ags)
    if() firstname has Miss and age is blah blah) 
        maritalstatus=single
    elif 
        
    else

### a)  View the first few rows of data

## <font color='blue'>7 Creating crosstabs and grouping data</font>

### a) Create crosstabs

Things to think about:
- data types of variables you're interested in

PLACEHOLDER: DESCRIBE WHAT A CROSS TAB IS

OTHER NOTES: This would be a good example to look at the help file for.  Explain what normalization means.  https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.crosstab.html

Also talk about formatting for normalized crosstab â€“ how do you limit the number of decimal points?
pd.crosstab(df.A,df.B, normalize='index').round(4)*100

In [ ]:
pd.crosstab(titanic.pclass, titanic.survived)

Use the normalize argument to display crosstab values as percentages

In [ ]:
pd.crosstab(titanic.pclass, titanic.survived, normalize='index')

Cross tabs aren't just limited to comparing two variables at a time. Let's say we want to compare passenger class, sex and survival rates. We can use square brackets [ ] to incorporate more variables into the crosstab, similar to earlier exammples.

In [ ]:
pd.crosstab([titanic.pclass, titanic.sex], titanic.survived, normalize='index')

### b) Grouping Data 

- when does it make sense to use sum, mean, value_counts?

In [ ]:
titanic.groupby('pclass').mean()

In [ ]:
titanic.groupby('pclass').sum()

In [ ]:
titanic.groupby('pclass')['survived'].sum()

In [ ]:
titanic.groupby('pclass')['survived'].value_counts()

### Exercise

1. Create a crosstab to show the numbers of men and women who survived.
2. Create a table to show the same data using groupby.

Which output is easier to read?

In [ ]:
pd.crosstab(titanic.sex, titanic.survived)

In [ ]:
titanic.groupby('sex')['survived'].value_counts()

__PLACEHOLDER: COULD DO THE REVIEW OF SELECTING DATA AT THIS POINT SINCE WE'RE ABOUT TO DO A BUNCH OF IT__

## <font color='blue'>8 Editing data and creating new fields</font>

### a. Renaming variable categories

Often variables in datasets use codes that aren't very descriptive. It's helpful to first view all codes in a variable before editing.

In [5]:
titanic['embarked'].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

Next, read the codebook to understand what the codes mean. There are 3 codes for embarkation points: S = Southampton, C = Cherbourg and Q = Queenstown. Start the next line with the name of the variable you would like to edit, e.g. titanic['embarked']. 

Use the = sign next to make sure you write the change to the entire variable and save it. This is similar to value assignment in algebra, e.g. x = y + z. 

We can use the .replace( ) method to change our codes to names. We can use .value_counts( ) to check our work.

In [6]:
titanic['embarked'] = titanic['embarked'].replace(['S', "C", "Q"], ["Southampton", "Cherbourg", "Queenstown"])

In [7]:
titanic['embarked'].value_counts()

Southampton    914
Cherbourg      270
Queenstown     123
Name: embarked, dtype: int64

### b. Creating new variables

The syntax for creating new variables in a dataframe starts by calling the dataframe by name and placing the variable name is square brackets in quotes and assigning value with an equal sign. e.g. dataframe['new variable'] = value.

Let's say we want to calculate the fare variable in Canadian dollars. In 1912, the value of the Canadian dollar was pegged at 4.8666CAD to one British Pound Sterling.

In [ ]:
titanic['fare_CAD'] = titanic['fare']*4.8666

Check if the new variable has been added by using the .head( ) method.

In [ ]:
titanic.head()

### c. Splitting First and Last Name

### d. creating age bins

## Exercise

Create a new variable called 'is_child'. Filter the data for all passengers under the age of 18 and assign the results to the new variable. Check your new variable using .value_counts(). Next, do a crosstab to check survival rates for children vs. adults. **Bonus:** Add pclass to the crosstab to see how many children and adults in first, second, and third class survived or perished.

__PLACEHOLDER: Scaffold into 3 code blocks with some instruction e.g. first do x.__

In [ ]:
## solution titanic['is_child'] = titanic['age'] < 18

In [ ]:
## solution titanic['is_child'].value_counts()

In [ ]:
## solution pd.crosstab(titanic.is_child, titanic.survived)